IDEA Open Model
BeamData Class
 Provides data of the connected beam
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.BeamData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class BeamData
Public Class BeamData
public ref class BeamData
The BeamData type exposes the following members.
Constructors
Name | Description
BeamData
Initializes a new instance of the BeamData class
Top
Properties
Name | Description
AddedMember
 Added member
CrossSectionType
 Type of cross section
Cuts
 Cuts on the beam
Id
 Id of the beam
IsAdded
 Is addes beam
MirrorY
 Mirro by Y
MPRLName
 MPRL name of beam
Name
 Name of the beam
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
Plates
 Plates of the beam
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace